nguyentri/nuttx/boards/arm/ra8/fpb-ra8e1/src/ra8e1_gps_demo.c
/****************************************************************************
 * boards/arm/ra8/fpb-ra8e1/src/ra8e1_gps_demo.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <fcntl.h>
#include <unistd.h>
#include <debug.h>
#include <errno.h>
#include <assert.h>

#include <nuttx/serial/serial.h>
#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/kmalloc.h>
#include <arch/board/board.h>

#include "arm_internal.h"
#include "chip.h"
#include "ra_gpio.h"
#include "ra_uart.h"
#include "ra8e1_gps_demo.h"
#include "ra8e1_demo_log.h"

#ifdef CONFIG_EXAMPLES_GPS

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* GPS NMEA Parameters */
#define GPS_BAUDRATE            38400    /* GPS baud rate */
#define GPS_UART_NUM            3        /* UART3 for GPS */
#define GPS_RX_BUFFER_SIZE      128      /* RX buffer size */
#define GPS_TX_BUFFER_SIZE      64       /* TX buffer size */

/* NMEA Sentence Parameters */
#define NMEA_MAX_SENTENCE_LEN   82       /* Maximum NMEA sentence length */
#define NMEA_MAX_FIELDS         20       /* Maximum fields in NMEA sentence */
#define NMEA_START_CHAR         '$'      /* NMEA start character */
#define NMEA_CHECKSUM_CHAR      '*'      /* NMEA checksum delimiter */

/* Buffer Configuration */
#define RTT_BUFFER_SIZE         64       /* RTT command buffer size */

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* NMEA Parser State */
struct nmea_parser_s
{
  char sentence[NMEA_MAX_SENTENCE_LEN]; /* Current sentence buffer */
  uint8_t sentence_pos;                 /* Current position in sentence */
  bool sentence_ready;                  /* Sentence ready for parsing */
  uint8_t checksum;                     /* Calculated checksum */
  bool checksum_mode;                   /* In checksum mode */
  uint32_t sentence_count;              /* Total sentence count */
  uint32_t parse_errors;                /* Parse error count */
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* NMEA parser state */
static struct nmea_parser_s g_nmea_parser;

/* UART device for GPS */
static ra_uart_dev_t g_gps_uart;

/* GPS data */
static struct gps_data_s g_gps_data;

/* DMA buffers */
static uint8_t g_gps_rx_buffer[GPS_RX_BUFFER_SIZE];
static uint8_t g_gps_tx_buffer[GPS_TX_BUFFER_SIZE];

/* RTT command buffer */
static char g_rtt_buffer[RTT_BUFFER_SIZE];
static volatile bool g_demo_running = false;

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int gps_uart_initialize(void);
static void gps_uart_callback(ra_uart_dev_t *dev, uint32_t event);
static void nmea_process_byte(uint8_t byte);
static bool nmea_parse_sentence(const char *sentence);
static bool nmea_checksum_valid(const char *sentence);
static int nmea_parse_gga(const char *sentence);
static int nmea_parse_rmc(const char *sentence);
static int nmea_parse_gsa(const char *sentence);
static double nmea_parse_coordinate(const char *field, const char *dir_field);
static float nmea_parse_float(const char *field);
static int nmea_parse_int(const char *field);
static void nmea_split_fields(const char *sentence, char fields[][16], int *field_count);
static void gps_print_position(void);
static void gps_print_status(void);
static void process_rtt_command(const char *command);
static void print_menu(void);

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: gps_uart_initialize
 *
 * Description:
 *   Initialize UART for GPS communication
 *
 ****************************************************************************/

static int gps_uart_initialize(void)
{
  ra_uart_config_t config;
  int ret;

  /* Configure UART for GPS */
  memset(&config, 0, sizeof(config));
  config.base = R_SCI3_BASE;
  config.baud = GPS_BAUDRATE;
  config.bits = 8;
  config.parity = 0; /* No parity */
  config.stop = 1;   /* 1 stop bit */
  
  /* Pin configuration for UART3 */
  config.tx_pin = RA_GPIO_PIN(RA_GPIO_PORT3, 10); /* P310 - TXD3 */
  config.rx_pin = RA_GPIO_PIN(RA_GPIO_PORT3, 9);  /* P309 - RXD3 */
  
  /* DMA configuration */
  config.rx_dma.enabled = true;
  config.rx_dma.channel = 2;
  config.tx_dma.enabled = true;
  config.tx_dma.channel = 3;
  
  /* Set up device structure */
  g_gps_uart.config = &config;
  g_gps_uart.rx_buffer = g_gps_rx_buffer;
  g_gps_uart.rx_buffer_size = GPS_RX_BUFFER_SIZE;
  g_gps_uart.tx_buffer = g_gps_tx_buffer;
  g_gps_uart.tx_buffer_size = GPS_TX_BUFFER_SIZE;
  g_gps_uart.callback = gps_uart_callback;
  
  /* Initialize UART with DMA */
  ret = ra_uart_initialize(&g_gps_uart);
  if (ret < 0)
    {
      demoerr("GPS: Failed to initialize UART: %d\n", ret);
      return ret;
    }
  
  demoinfo("GPS: UART3 initialized for 38400 baud, 8N1\n");
  return OK;
}

/****************************************************************************
 * Name: gps_uart_callback
 *
 * Description:
 *   UART callback for GPS data reception
 *
 ****************************************************************************/

static void gps_uart_callback(ra_uart_dev_t *dev, uint32_t event)
{
  int i;
  
  if (event & RA_UART_EVENT_RX_CHAR)
    {
      /* Process received bytes */
      for (i = 0; i < dev->rx_count; i++)
        {
          nmea_process_byte(dev->rx_buffer[i]);
        }
    }
  
