nguyentri/nuttx/boards/arm/ra8/fpb-ra8e1/src/ra8e1_gps_demo.c
  if (event & (RA_UART_EVENT_ERR_PARITY | RA_UART_EVENT_ERR_FRAMING | RA_UART_EVENT_ERR_OVERFLOW))
    {
      g_nmea_parser.parse_errors++;
      demowarn("GPS: UART error event: 0x%08x\n", event);
    }
}

/****************************************************************************
 * Name: nmea_process_byte
 *
 * Description:
 *   Process a single byte from GPS NMEA stream
 *
 ****************************************************************************/

static void nmea_process_byte(uint8_t byte)
{
  /* NMEA sentence parsing state machine */
  if (byte == NMEA_START_CHAR)
    {
      /* Start of new sentence */
      g_nmea_parser.sentence_pos = 0;
      g_nmea_parser.checksum = 0;
      g_nmea_parser.checksum_mode = false;
      g_nmea_parser.sentence_ready = false;
      g_nmea_parser.sentence[g_nmea_parser.sentence_pos++] = byte;
    }
  else if (g_nmea_parser.sentence_pos > 0)
    {
      /* Continue building sentence */
      if (byte == NMEA_CHECKSUM_CHAR)
        {
          g_nmea_parser.checksum_mode = true;
          g_nmea_parser.sentence[g_nmea_parser.sentence_pos++] = byte;
        }
      else if (byte == '\r' || byte == '\n')
        {
          /* End of sentence */
          g_nmea_parser.sentence[g_nmea_parser.sentence_pos] = '\0';
          g_nmea_parser.sentence_ready = true;
          
          /* Process complete sentence */
          if (nmea_parse_sentence(g_nmea_parser.sentence))
            {
              g_nmea_parser.sentence_count++;
            }
          else
            {
              g_nmea_parser.parse_errors++;
            }
          
          g_nmea_parser.sentence_pos = 0;
        }
      else if (g_nmea_parser.sentence_pos < NMEA_MAX_SENTENCE_LEN - 1)
        {
          g_nmea_parser.sentence[g_nmea_parser.sentence_pos++] = byte;
          
          /* Calculate checksum (exclude $ and * characters) */
          if (!g_nmea_parser.checksum_mode && byte != NMEA_START_CHAR)
            {
              g_nmea_parser.checksum ^= byte;
            }
        }
      else
        {
          /* Sentence too long, reset */
          g_nmea_parser.sentence_pos = 0;
          g_nmea_parser.parse_errors++;
        }
    }
}

/****************************************************************************
 * Name: nmea_parse_sentence
 *
 * Description:
 *   Parse complete NMEA sentence
 *
 ****************************************************************************/

static bool nmea_parse_sentence(const char *sentence)
{
  if (!sentence || strlen(sentence) < 6)
    {
      return false;
    }
  
  /* Validate checksum */
  if (!nmea_checksum_valid(sentence))
    {
      return false;
    }
  
  /* Parse specific sentence types */
  if (strncmp(sentence, "$GPGGA", 6) == 0 || strncmp(sentence, "$GNGGA", 6) == 0)
    {
      return nmea_parse_gga(sentence) == OK;
    }
  else if (strncmp(sentence, "$GPRMC", 6) == 0 || strncmp(sentence, "$GNRMC", 6) == 0)
    {
      return nmea_parse_rmc(sentence) == OK;
    }
  else if (strncmp(sentence, "$GPGSA", 6) == 0 || strncmp(sentence, "$GNGSA", 6) == 0)
    {
      return nmea_parse_gsa(sentence) == OK;
    }
  
  /* Unknown sentence type, but valid checksum */
  return true;
}

/****************************************************************************
 * Name: nmea_checksum_valid
 *
 * Description:
 *   Validate NMEA sentence checksum
 *
 ****************************************************************************/

static bool nmea_checksum_valid(const char *sentence)
{
  const char *checksum_ptr;
  uint8_t calculated_checksum = 0;
  uint8_t received_checksum;
  int i;
  
  /* Find checksum delimiter */
  checksum_ptr = strchr(sentence, '*');
  if (!checksum_ptr || strlen(checksum_ptr) < 3)
    {
      return false;
    }
  
  /* Calculate checksum */
  for (i = 1; i < (checksum_ptr - sentence); i++)
    {
      calculated_checksum ^= sentence[i];
    }
  
  /* Parse received checksum */
  received_checksum = (uint8_t)strtol(checksum_ptr + 1, NULL, 16);
  
  return calculated_checksum == received_checksum;
}

/****************************************************************************
 * Name: nmea_split_fields
 *
 * Description:
 *   Split NMEA sentence into fields
 *
 ****************************************************************************/

static void nmea_split_fields(const char *sentence, char fields[][16], int *field_count)
{
  int len = strlen(sentence);
  int field_idx = 0;
  int char_idx = 0;
  int i;
  
  *field_count = 0;
  
  for (i = 0; i < len && field_idx < NMEA_MAX_FIELDS; i++)
    {
      if (sentence[i] == ',' || sentence[i] == '*')
        {
          fields[field_idx][char_idx] = '\0';
          field_idx++;
          char_idx = 0;
          (*field_count)++;
        }
      else if (char_idx < 15)
        {
          fields[field_idx][char_idx++] = sentence[i];
        }
    }
  
  if (field_idx < NMEA_MAX_FIELDS && char_idx > 0)
    {
      fields[field_idx][char_idx] = '\0';
      (*field_count)++;
    }
}

/****************************************************************************
 * Name: nmea_parse_gga
 *
 * Description:
 *   Parse GGA (Global Positioning System Fix Data) sentence
 *
 ****************************************************************************/

static int nmea_parse_gga(const char *sentence)
{
  char fields[NMEA_MAX_FIELDS][16];
  int field_count;
  
  nmea_split_fields(sentence, fields, &field_count);
  
  if (field_count < 15)
    {
      return -EINVAL;
    }
  
  /* Parse time (field 1) */
  if (strlen(fields[1]) >= 6)
    {
      char time_str[3];
      time_str[2] = '\0';
      
      strncpy(time_str, fields[1], 2);
      g_gps_data.hour = atoi(time_str);
      
      strncpy(time_str, fields[1] + 2, 2);
      g_gps_data.minute = atoi(time_str);
      
      strncpy(time_str, fields[1] + 4, 2);
      g_gps_data.second = atoi(time_str);
    }
  
  /* Parse latitude (fields 2, 3) */
  g_gps_data.latitude = nmea_parse_coordinate(fields[2], fields[3]);
  
  /* Parse longitude (fields 4, 5) */
  g_gps_data.longitude = nmea_parse_coordinate(fields[4], fields[5]);
  
