nguyentri/nuttx/boards/arm/ra8/fpb-ra8e1/src/ra8e1_gps_demo.c
  /* Parse fix quality (field 6) */
  g_gps_data.fix_type = nmea_parse_int(fields[6]);
  g_gps_data.fix_valid = g_gps_data.fix_type > 0;
  
  /* Parse satellites used (field 7) */
  g_gps_data.satellites_used = nmea_parse_int(fields[7]);
  
  /* Parse HDOP (field 8) */
  g_gps_data.hdop = nmea_parse_float(fields[8]);
  
  /* Parse altitude (field 9) */
  g_gps_data.altitude = nmea_parse_float(fields[9]);
  
  /* Update timestamp */
  g_gps_data.timestamp = up_systime();
  
  return OK;
}

/****************************************************************************
 * Name: nmea_parse_rmc
 *
 * Description:
 *   Parse RMC (Recommended Minimum) sentence
 *
 ****************************************************************************/

static int nmea_parse_rmc(const char *sentence)
{
  char fields[NMEA_MAX_FIELDS][16];
  int field_count;
  
  nmea_split_fields(sentence, fields, &field_count);
  
  if (field_count < 12)
    {
      return -EINVAL;
    }
  
  /* Parse status (field 2) */
  g_gps_data.fix_valid = (fields[2][0] == 'A');
  
  /* Parse speed (field 7) - convert from knots to km/h */
  g_gps_data.speed_kmh = nmea_parse_float(fields[7]) * 1.852f;
  
  /* Parse course (field 8) */
  g_gps_data.course = nmea_parse_float(fields[8]);
  
  /* Parse date (field 9) */
  if (strlen(fields[9]) >= 6)
    {
      char date_str[3];
      date_str[2] = '\0';
      
      strncpy(date_str, fields[9], 2);
      g_gps_data.day = atoi(date_str);
      
      strncpy(date_str, fields[9] + 2, 2);
      g_gps_data.month = atoi(date_str);
      
      strncpy(date_str, fields[9] + 4, 2);
      g_gps_data.year = 2000 + atoi(date_str);
    }
  
  return OK;
}

/****************************************************************************
 * Name: nmea_parse_gsa
 *
 * Description:
 *   Parse GSA (GPS DOP and active satellites) sentence
 *
 ****************************************************************************/

static int nmea_parse_gsa(const char *sentence)
{
  char fields[NMEA_MAX_FIELDS][16];
  int field_count;
  
  nmea_split_fields(sentence, fields, &field_count);
  
  if (field_count < 18)
    {
      return -EINVAL;
    }
  
  /* Parse PDOP (field 15) */
  g_gps_data.pdop = nmea_parse_float(fields[15]);
  
  /* Parse HDOP (field 16) */
  g_gps_data.hdop = nmea_parse_float(fields[16]);
  
  /* Parse VDOP (field 17) */
  g_gps_data.vdop = nmea_parse_float(fields[17]);
  
  return OK;
}

/****************************************************************************
 * Name: nmea_parse_coordinate
 *
 * Description:
 *   Parse NMEA coordinate (DDMM.MMMMM format)
 *
 ****************************************************************************/

static double nmea_parse_coordinate(const char *field, const char *dir_field)
{
  double coord = 0.0;
  double degrees, minutes;
  
  if (strlen(field) < 4)
    {
      return 0.0;
    }
  
  /* Parse degrees and minutes */
  if (strlen(field) > 4)
    {
      /* Latitude: DDMM.MMMMM */
      degrees = (field[0] - '0') * 10 + (field[1] - '0');
      minutes = atof(field + 2);
    }
  else
    {
      /* Longitude: DDDMM.MMMMM */
      degrees = (field[0] - '0') * 100 + (field[1] - '0') * 10 + (field[2] - '0');
      minutes = atof(field + 3);
    }
  
  coord = degrees + minutes / 60.0;
  
  /* Apply direction */
  if (dir_field[0] == 'S' || dir_field[0] == 'W')
    {
      coord = -coord;
    }
  
  return coord;
}

/****************************************************************************
 * Name: nmea_parse_float
 *
 * Description:
 *   Parse float from NMEA field
 *
 ****************************************************************************/

static float nmea_parse_float(const char *field)
{
  if (!field || strlen(field) == 0)
    {
      return 0.0f;
    }
  
  return (float)atof(field);
}

/****************************************************************************
 * Name: nmea_parse_int
 *
 * Description:
 *   Parse integer from NMEA field
 *
 ****************************************************************************/

static int nmea_parse_int(const char *field)
{
  if (!field || strlen(field) == 0)
    {
      return 0;
    }
  
  return atoi(field);
}

/****************************************************************************
 * Name: gps_print_position
 *
 * Description:
 *   Print GPS position information
 *
 ****************************************************************************/

static void gps_print_position(void)
{
  demoprintf("\nGPS Position:\n");
  demoprintf("  Fix: %s (Type: %d)\n", 
             g_gps_data.fix_valid ? "Valid" : "Invalid", g_gps_data.fix_type);
  demoprintf("  Latitude:  %.6f°\n", g_gps_data.latitude);
  demoprintf("  Longitude: %.6f°\n", g_gps_data.longitude);
  demoprintf("  Altitude:  %.1f m\n", g_gps_data.altitude);
  demoprintf("  Speed:     %.1f km/h\n", g_gps_data.speed_kmh);
  demoprintf("  Course:    %.1f°\n", g_gps_data.course);
  demoprintf("  Time:      %02d:%02d:%02d UTC\n", 
             g_gps_data.hour, g_gps_data.minute, g_gps_data.second);
  demoprintf("  Date:      %02d/%02d/%04d\n", 
             g_gps_data.day, g_gps_data.month, g_gps_data.year);
  demoprintf("  Satellites: %d\n", g_gps_data.satellites_used);
  demoprintf("  HDOP:      %.1f\n", g_gps_data.hdop);
  demoprintf("  VDOP:      %.1f\n", g_gps_data.vdop);
  demoprintf("  PDOP:      %.1f\n", g_gps_data.pdop);
}

/****************************************************************************
 * Name: gps_print_status
 *
 * Description:
 *   Print GPS reception status
 *
 ****************************************************************************/

static void gps_print_status(void)
{
  uint32_t current_time = up_systime();
  uint32_t time_since_last = current_time - g_gps_data.timestamp;
  
  demoprintf("\nGPS Status:\n");
  demoprintf("  Sentences received: %u\n", g_nmea_parser.sentence_count);
  demoprintf("  Parse errors: %u\n", g_nmea_parser.parse_errors);
  demoprintf("  Last update: %u ms ago\n", time_since_last);
  demoprintf("  Message rate: %.1f Hz\n", 
             g_nmea_parser.sentence_count > 0 ? (float)g_nmea_parser.sentence_count * 1000.0f / current_time : 0.0f);
}

/****************************************************************************
 * Name: print_menu
 *
 * Description:
 *   Print RTT command menu
 *
 ****************************************************************************/

static void print_menu(void)
{
  demoprintf("\nGPS Demo Commands:\n");
  demoprintf("  p - Show position\n");
  demoprintf("  s - Show status\n");
  demoprintf("  r - Reset counters\n");
  demoprintf("  h - Show this menu\n");
  demoprintf("  q - Quit demo\n");
}

/****************************************************************************
 * Name: process_rtt_command
 *
 * Description:
 *   Process RTT commands
 *
 ****************************************************************************/

static void process_rtt_command(const char *command)
{
  if (!command || strlen(command) == 0)
    {
      return;
    }
  
  switch (command[0])
    {
      case 'p':
      case 'P':
        gps_print_position();
        break;
        
