nguyentri/nuttx/boards/arm/ra8/fpb-ra8e1/src/ra8e1_gps_demo.c
      case 's':
      case 'S':
        gps_print_status();
        break;
        
      case 'r':
      case 'R':
        g_nmea_parser.sentence_count = 0;
        g_nmea_parser.parse_errors = 0;
        demoprintf("Counters reset\n");
        break;
        
      case 'h':
      case 'H':
        print_menu();
        break;
        
      case 'q':
      case 'Q':
        g_demo_running = false;
        demoinfo("Exiting GPS demo\n");
        break;
        
      default:
        demoprintf("Unknown command: %c\n", command[0]);
        print_menu();
        break;
    }
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: ra8e1_gps_demo_init
 *
 * Description:
 *   Initialize the GPS demo
 *
 ****************************************************************************/

int ra8e1_gps_demo_init(void)
{
  /* GPS demo initialization is done within main function */
  return 0;
}

/****************************************************************************
 * Name: ra8e1_gps_demo_main
 *
 * Description:
 *   GPS demo main function
 *
 ****************************************************************************/

int ra8e1_gps_demo_main(int argc, char *argv[])
{
  int ret;
  int key;
  uint8_t cmd_pos = 0;
  
  demoprintf("\nRA8E1 GPS Demo Starting...\n");
  demoprintf("GPS TX: P310 (TXD3) -> GPS RX\n");
  demoprintf("GPS RX: P309 (RXD3) <- GPS TX\n");
  demoprintf("Configuration: 38400 baud, 8N1\n\n");
  
  /* Initialize NMEA parser */
  memset(&g_nmea_parser, 0, sizeof(g_nmea_parser));
  memset(&g_gps_data, 0, sizeof(g_gps_data));
  
  /* Initialize UART for GPS */
  ret = gps_uart_initialize();
  if (ret < 0)
    {
      demoerr("GPS: Failed to initialize UART: %d\n", ret);
      return ret;
    }
  
  print_menu();
  g_demo_running = true;
  
  demoinfo("Demo initialized - ready for commands\n");

  /* Main demo loop */
  while (g_demo_running)
    {
      /* Check for input */
      if (demo_haskey())
        {
          key = demo_getkey();
          if (key >= 0)
            {
              if (key == '\r' || key == '\n')
                {
                  if (cmd_pos > 0)
                    {
                      g_rtt_buffer[cmd_pos] = '\0';
                      process_rtt_command(g_rtt_buffer);
                      cmd_pos = 0;
                    }
                }
              else if (key == '\b' || key == 127) /* Backspace */
                {
                  if (cmd_pos > 0)
                    {
                      cmd_pos--;
                    }
                }
              else if (cmd_pos < RTT_BUFFER_SIZE - 1)
                {
                  g_rtt_buffer[cmd_pos++] = key;
                }
            }
        }
      
      /* Small delay to prevent overwhelming the system */
      usleep(10000); /* 10ms */
    }
  
  /* Cleanup */
  ra_uart_finalize(&g_gps_uart);
  demoinfo("GPS demo finished\n");
  
  return OK;
}

/****************************************************************************
 * Name: ra8e1_gps_parse
 *
 * Description:
 *   Parse GPS NMEA sentence (public interface)
 *
 ****************************************************************************/

int ra8e1_gps_parse(const char *nmea_sentence, struct gps_data_s *gps_data)
{
  if (!nmea_sentence || !gps_data)
    {
      return -EINVAL;
    }
  
  /* This is a simplified interface - in practice, you would 
   * maintain state and parse multiple sentence types */
  
  if (strncmp(nmea_sentence, "$GPGGA", 6) == 0 || strncmp(nmea_sentence, "$GNGGA", 6) == 0)
    {
      /* Copy current data and parse GGA */
      memcpy(gps_data, &g_gps_data, sizeof(struct gps_data_s));
      return nmea_parse_gga(nmea_sentence);
    }
  
  return -ENOTSUP;
}

#endif /* CONFIG_EXAMPLES_GPS */
